#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Plan 📖`success`
<details><summary>Show plan</summary>

```terraform
random_uuid.client_username: Refreshing state... [id=74f3944e-158b-1152-e3a2-5a75f6db7eb2]
random_pet.client_hostname: Refreshing state... [id=humane-mule]
random_password.client_password: Refreshing state... [id=none]
aws_route53_zone.zone[0]: Refreshing state... [id=Z0731691HCUZ2USURPU3]
cloudfoundry_service_instance.db: Refreshing state... [id=3e12a3dd-bf24-46d3-83d7-46f34e72209c]
cloudfoundry_route.ssb_uri: Refreshing state... [id=24aa4225-dbae-46a6-86a8-074472edc0f8]
cloudfoundry_app.ssb: Refreshing state... [id=b5bd11e2-36d3-4334-a00d-ebb0d1b32bc2]
cloudfoundry_service_broker.space-scoped-broker["gsa-datagov/management-staging"]: Refreshing state... [id=0dd56a14-04b8-4602-a088-86711e165b0b]

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.

```

</details>

#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Plan 📖`success`
<details><summary>Show plan</summary>

```terraform
random_uuid.client_username: Refreshing state... [id=a1582ac8-4a25-1669-b5ca-af0011e0ab25]
random_pet.client_hostname: Refreshing state... [id=deep-dingo]
random_password.client_password: Refreshing state... [id=none]
aws_route53_zone.sandbox_zone: Refreshing state... [id=Z100993817TJFWA5QJDPB]
aws_route53_zone.zone[0]: Refreshing state... [id=Z10387623VC2UL2NU3ZZ9]
cloudfoundry_route.ssb_uri: Refreshing state... [id=32a63578-b902-4648-92ab-5a945d16c6a1]
cloudfoundry_service_instance.db: Refreshing state... [id=3c9a0f58-c784-4f71-8872-f2052c95df43]
cloudfoundry_app.ssb: Refreshing state... [id=8189025d-5159-4e53-93d9-60a0bc24c4c5]
cloudfoundry_service_broker.space-scoped-broker["gsa-datagov/prod"]: Refreshing state... [id=a508e14d-c0d0-42b9-9904-eb3f2458b3d8]
cloudfoundry_service_broker.space-scoped-broker["gsa-datagov/staging"]: Refreshing state... [id=29140105-f171-46c2-9634-5dd8305223a9]
cloudfoundry_service_broker.space-scoped-broker["gsa-datagov/development"]: Refreshing state... [id=c17a5163-fc28-4dcf-b410-6c3fb9905c5b]
cloudfoundry_service_broker.space-scoped-broker["gsa-datagov/management"]: Refreshing state... [id=e2c06bb8-665c-42d4-86e4-861ef33438e0]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_route53_zone.sandbox_zone will be destroyed
  - resource "aws_route53_zone" "sandbox_zone" {
      - comment       = "Managed by Terraform" -> null
      - force_destroy = false -> null
      - id            = "Z100993817TJFWA5QJDPB" -> null
      - name          = "ssb.datagov.us." -> null
      - name_servers  = [
          - "ns-1116.awsdns-11.org",
          - "ns-117.awsdns-14.com",
          - "ns-1954.awsdns-52.co.uk",
          - "ns-766.awsdns-31.net",
        ] -> null
      - tags          = {} -> null
      - zone_id       = "Z100993817TJFWA5QJDPB" -> null
    }

  # aws_route53_zone.zone[0] must be replaced
-/+ resource "aws_route53_zone" "zone" {
      ~ id            = "Z10387623VC2UL2NU3ZZ9" -> (known after apply)
      ~ name          = "ssb.data.gov." -> "ssb.datagov.us" # forces replacement
      ~ name_servers  = [
          - "ns-1157.awsdns-16.org",
          - "ns-1573.awsdns-04.co.uk",
          - "ns-212.awsdns-26.com",
          - "ns-759.awsdns-30.net",
        ] -> (known after apply)
      - tags          = {} -> null
      + vpc_id        = (known after apply)
      + vpc_region    = (known after apply)
      ~ zone_id       = "Z10387623VC2UL2NU3ZZ9" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # cloudfoundry_app.ssb will be updated in-place
  ~ resource "cloudfoundry_app" "ssb" {
      ~ environment          = (sensitive value)
        id                   = "8189025d-5159-4e53-93d9-60a0bc24c4c5"
      ~ id_bg                = "8189025d-5159-4e53-93d9-60a0bc24c4c5" -> (known after apply)
        name                 = "ssb"
        # (16 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # cloudfoundry_service_broker.space-scoped-broker["gsa-datagov/development"] will be updated in-place
  ~ resource "cloudfoundry_service_broker" "space-scoped-broker" {
      ~ catalog_change                   = true -> false
        id                               = "c17a5163-fc28-4dcf-b410-6c3fb9905c5b"
        name                             = "ssb-gsa-datagov-development"
        # (8 unchanged attributes hidden)
    }

  # cloudfoundry_service_broker.space-scoped-broker["gsa-datagov/management"] will be updated in-place
  ~ resource "cloudfoundry_service_broker" "space-scoped-broker" {
      ~ catalog_change                   = true -> false
        id                               = "e2c06bb8-665c-42d4-86e4-861ef33438e0"
        name                             = "ssb-gsa-datagov-management"
        # (8 unchanged attributes hidden)
    }

  # cloudfoundry_service_broker.space-scoped-broker["gsa-datagov/prod"] will be updated in-place
  ~ resource "cloudfoundry_service_broker" "space-scoped-broker" {
      ~ catalog_change                   = true -> false
        id                               = "a508e14d-c0d0-42b9-9904-eb3f2458b3d8"
        name                             = "ssb-gsa-datagov-prod"
        # (8 unchanged attributes hidden)
    }

  # cloudfoundry_service_broker.space-scoped-broker["gsa-datagov/staging"] will be updated in-place
  ~ resource "cloudfoundry_service_broker" "space-scoped-broker" {
      ~ catalog_change                   = true -> false
        id                               = "29140105-f171-46c2-9634-5dd8305223a9"
        name                             = "ssb-gsa-datagov-staging"
        # (8 unchanged attributes hidden)
    }

Plan: 1 to add, 5 to change, 2 to destroy.

Changes to Outputs:
  - route53_sandbox_zone_nameservers = [
      - "ns-1116.awsdns-11.org",
      - "ns-117.awsdns-14.com",
      - "ns-1954.awsdns-52.co.uk",
      - "ns-766.awsdns-31.net",
    ] -> null
  ~ route53_zone_nameservers         = [
      - "ns-1157.awsdns-16.org",
      - "ns-1573.awsdns-04.co.uk",
      - "ns-212.awsdns-26.com",
      - "ns-759.awsdns-30.net",
    ] -> [
      + (known after apply),
    ]

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.


```

</details>          

*Pusher: @mogul, Action: `pull_request`*